app/controllers/reservations_controller.rb

  def create
    puts 'create'
    #@room = Reservation.new(reservation_params)
    require 'date'

    new_params= {}
    x = params[:reservation][:booking_date].split("/").to_a
    dateField = Date.new(x[2].to_i,x[0].to_i,x[1].to_i)
    new_params[:booking_date] = dateField
    new_params[:start_time] = params[:reservation][:start_time]
    new_params[:end_time] = params[:reservation][:end_time]
    new_params[:status] = 'booked'
    new_params[:room_id] = params[:room]
    new_params[:user_id] = current_user.id

    puts new_params.to_s
    @reservation = Reservation.new(new_params)

    respond_to do |format|
      if @reservation.save
---
INSERT INTO "reservations" ("booking_date", "end_time", "start_time", "status") VALUES (?, ?, ?, ?)  [["booking_date", Thu, 22 Sep 2016], ["end_time", "7"], ["start_time", "5"], ["status", "Booked"]]