app/controllers/rooms_controller.rb

INSERT INTO "rooms" ("building", "created_at", "number", "size", "updated_at") VALUES (?, ?, ?, ?, ?)  [["building", "James Hunt Library"], ["created_at", Thu, 22 Sep 2016 21:10:11 UTC +00:00], ["number", "2312"], ["size", "Medium- 6 chairs"], ["updated_at", Thu, 22 Sep 2016 21:10:11 UTC +00:00]]
---
  def create
    @room = Room.new(room_params)

    respond_to do |format|
      if @room.save