app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "name", "password", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Sat, 24 Sep 2016 05:56:23 UTC +00:00], ["email", "namrat@ncsu.edu"], ["name", "Namrata"], ["password", "vivek"], ["updated_at", Sat, 24 Sep 2016 05:56:23 UTC +00:00]]
---
  def create
    @user = User.new(user_params)

    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "users" SET "role" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["role", "member"], ["updated_at", Fri, 23 Sep 2016 07:00:33 UTC +00:00]]
---
  def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)